<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Microsoft Teams.</string>
	<key>Identifier</key>
	<string>com.github.niiconn.download.MicrosoftTeams</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft Teams</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
				<key>url</key>
				<string>https://r2.computerbild.de/exec/r2r.pl?m=w-cobi;u=https%3A%2F%2Fd.computerbild.de%2Fdownloads%2F12695861%2FTeams_osx.pkg%3F__cbodl__%3D1646127160_c451e043b446052646626b72e619121d%26_chksum_%3D4b28496918e9ddcd3277332e096f2d72;ct=1;thc=1;b=12695861;c=25665057;tit=Microsoft+Teams+%28Mac%29+1.5.00.4683;url=https%3A%2F%2Fwww.computerbild.de%2Fdownload%2FMicrosoft-Teams-Mac-25665057.html;sep=%7C;tce=%7C;tid=482;tn=Chat-Programme+%26+Messenger;tp=95%7C364;tc=95%7C364%7C482;tpn=Software+Kategorie%7CInternet;cs=1;chk=9ecd206906870052</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
