<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.niiconn.pkg.Desktoppr</string>
	<key>Description</key>
	<string>Uses parent download recipe com.github.moofit-recipes.download.Desktoppr to download the latest Desktoppr</string>
	<key>Input</key>
	<dict>
				<key>NAME</key>
				<string>Desktoppr</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.niiconn.download.Desktoppr</string>
	<key>Process</key>
	<array>
				<dict>
						<key>Processor</key>
						<string>PkgCopier</string>
						<key>Arguments</key>
						<dict>
								<key>source_pkg</key>
								<string>%pathname%</string>
								<key>pkg_path</key>
								<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
						</dict>
				</dict>
		</array>
</dict>
</plist>